tests/load/load-test-config.yml
config:
  target: "https://multiplayersudoku.in"
  phases:
    - duration: 30
      arrivalCount: 500
      name: "stress_test_500_users"
  engines:
    playwright:
      launchOptions:
        args: ["--no-sandbox", "--disable-setuid-sandbox"]
  processor: "./playwright-processor.js"

scenarios:
  - name: "User Journey: Lobby to Active Solo Match"
    engine: "playwright"
    testFunction: "playSudokuTest"