tests/load/load-test-config.yml
config:
  target: "https://multiplayersudoku.in"
  phases:
    - duration: 60
      arrivalCount: 50
<<<<<<< HEAD
      name: "sustained_load_test"
=======
      name: "initial_smoke_test"
>>>>>>> 82cab52377aa607d2bc701874c6677856c4cae3d
  engines:
    playwright:
      launchOptions:
        args: ["--no-sandbox", "--disable-setuid-sandbox"]
  processor: "./playwright-processor.js"

scenarios:
  - name: "User Journey: Lobby to Active Solo Match"
    engine: "playwright"
    testFunction: "playSudokuTest"